# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
#  Пример:
#
#
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

# lst = [2, 3, 4, 5, 6]
lst = [2, 3, 5, 6]

product = []
for i in range(0, ((len(lst) + 1) // 2)):
    product.append(lst[i] * lst[- i - 1])

print(product)
